Revit 2027 API
BuiltInFailures.ProfileFailures.SketchNotEmpty Property
 Can't move the Profile Plane because the Profile Sketch is not empty. This operation is not supported at this time.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SketchNotEmpty { get; }
Public Shared ReadOnly Property SketchNotEmpty As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SketchNotEmpty {
	FailureDefinitionId^ get ();
}
static member SketchNotEmpty : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ProfileFailures Class
Autodesk.Revit.DB Namespace